{
  "backend/main.mo": "Main backend actor defining data models (ArtistProfile, JobOffering, Gig, Booking, Product, Music) with storage maps, access control initialization, admin privilege management, and includes authorization and storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting that payment configuration (Stripe settings) visibility for admin users is implemented across frontend hooks and AccountDashboardPage with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, query hooks, layout components, pages for artists/jobs/gigs/bookings/store/music/cart/payment/admin, and utility functions for file validation and bulk operations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point for the React application titled 'Artist Connect' with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application setup with TanStack Router configuration defining all routes (home, artists, jobs, gigs, bookings, store, music, cart, payment, admin, account), QueryClient provider, ThemeProvider, and Toaster components.",
  "frontend/src/components/BatchProductUpload.tsx": "Component for batch uploading products with file selection, preview, per-product metadata editing (name, description, price), validation, sequential product creation with progress tracking, and cleanup on completion.",
  "frontend/src/components/BulkImageUpload.tsx": "Reusable component for bulk image upload with file validation, preview display, per-image metadata input (category, subcategory, price, description), upload progress tracking, and ExternalBlob conversion with store configuration integration.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with links to Artists, Jobs, Gigs, Store, and Music Library, plus authentication controls, shopping cart icon with item count, and admin/user dropdown menus. Includes footer with social media links and uses Internet Identity for authentication.",
  "frontend/src/components/UserProfileSetup.tsx": "Placeholder component for user profile setup dialog that is currently disabled (showSetup always false). Intended for onboarding new users but skipped since backend lacks user profile methods.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous actors. Automatically invalidates and refetches dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useCart.ts": "Zustand store with localStorage persistence managing shopping cart state for products, gigs, and music items. Provides methods to add, remove, update quantities, clear cart, and calculate totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle. Provides status tracking (initializing, logging-in, success, error) and persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend API calls including artists, jobs, gigs, bookings, products, music, services, store configuration, and admin functions. Each hook handles query/mutation logic and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining warm earth-tone color palette for light and dark modes using OKLCH color space. Includes custom utility classes for gallery grids and artistic shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/AccountDashboardPage.tsx": "Account dashboard page displaying user's principal ID and navigation cards for product management, payment settings, and general settings. Shows admin setup prompt if user is authenticated but not an admin.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup page that allows authenticated users to grant themselves admin privileges. Redirects to account dashboard after successful admin grant or if user already has admin access.",
  "frontend/src/pages/AdminSiteConfigPage.tsx": "Admin-only page for configuring site-wide settings like site name, contact email, minimum price, and commission rate. Includes authentication and admin permission checks with loading states.",
  "frontend/src/pages/AdminStoreSettingsPage.tsx": "Admin page for managing store configuration including stock thresholds, shipping, tax rates, approval requirements, pricing rules, product categories, tags, featured products, and statuses. Loads existing config and allows adding/removing categories, tags, and other settings.",
  "frontend/src/pages/AdminStripeSettingsPage.tsx": "Admin-only page for configuring Stripe payment settings including publishable/secret keys, webhook configuration, currency, and test mode. Includes key validation, visibility toggles for sensitive data, and save functionality.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for managing user roles, displaying a table of all artists with their principals and roles, and allowing admins to promote users to admin or demote them to regular users with confirmation dialogs.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays a detailed artist profile page with portfolio gallery, bio, available services, and contact information, fetched by artist ID from route parameters.",
  "frontend/src/pages/ArtistsListPage.tsx": "Lists all artists in a grid layout with portfolio preview images, bios, skills tags, and links to individual artist profile pages.",
  "frontend/src/pages/BookingsPage.tsx": "Displays a user's scheduled bookings with service details including date, time, duration, and confirmation status in a card-based layout.",
  "frontend/src/pages/BookServicePage.tsx": "Service booking page that displays an artist's information and their available services with pricing, duration, and a button to select date/time for booking.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items (music, products, gigs) with quantity controls, calculates totals, and initiates Stripe checkout sessions with validation for Stripe configuration.",
  "frontend/src/pages/GigDetailPage.tsx": "Displays detailed information for a single gig, including title, pricing, delivery time, and description. Provides a 'Book Now' button that creates a Stripe checkout session for purchasing the gig.",
  "frontend/src/pages/GigsPage.tsx": "Lists all available gigs in a marketplace view and allows authenticated users to create new gigs via a dialog form. Displays gig cards with title, description, pricing, and delivery time information.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section showcasing the platform's value proposition and feature cards highlighting artist profiles, gig marketplace, bookings, job opportunities, and store. Includes navigation buttons to key sections.",
  "frontend/src/pages/JobOfferingDetailPage.tsx": "Displays detailed information for a single job posting, including job title, budget, deadline, and description. Provides an 'Apply for This Job' button and navigation back to the jobs list.",
  "frontend/src/pages/JobOfferingsPage.tsx": "Lists all job opportunities and allows authenticated users to post new job offerings via a dialog form. Displays job cards with title, budget, deadline, and description information.",
  "frontend/src/pages/MusicLibraryPage.tsx": "Displays a music library with playable tracks and allows authenticated users to upload and sell music files. Includes audio file validation, upload progress tracking, category selection, and add-to-cart functionality with configurable pricing rules.",
  "frontend/src/pages/MyProfilePage.tsx": "Artist profile management page allowing users to create/edit their bio, skills, contact info, and upload portfolio images with progress tracking. Requires Internet Identity authentication.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error information, common failure reasons, and action buttons to return to cart or home. Informs users their cart items are saved.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Payment settings page showing user's principal ID and payment method information. Displays authentication-gated content with loading states and Stripe integration notes.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that displays contextual messages based on purchase type (product/music/gig), clears the cart, and provides navigation to home or store.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page displaying individual product information with images, description, price, and add-to-cart functionality. Includes navigation back to store and cart.",
  "frontend/src/pages/ProductManagementPage.tsx": "Product management dashboard for authenticated artists to view, edit, and delete their own products. Includes batch upload dialog and filters products by owner principal ID.",
  "frontend/src/pages/StorePage.tsx": "Store page component that displays products, handles single and bulk product creation with image uploads, and integrates with cart functionality and Internet Identity authentication.",
  "frontend/src/utils/fileValidation.ts": "Utility functions for validating image file uploads, checking file types (JPEG, PNG, GIF, WebP) and enforcing a 10MB size limit for single and batch operations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters across hash-based and browser-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography settings, animations, and design tokens for a consistent UI theme.",
  "project_state.json": "Project metadata tracking a fix request to grant admin privileges to the current user, with existing features for payment configuration visibility and known issues documented."
}