{
  "backend/main.mo": "Main Motoko actor defining data types and storage maps for artists, jobs, gigs, bookings, products, and music, with included mixins for authorization and blob storage functionality.",
  "feature_evidence.json": "Feature evidence report documenting batch product upload functionality across frontend components, including multi-image selection, editable product entries, preset defaults, batch creation logic, and toast notifications.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx with routing, useQueries hooks for backend operations, Layout component, payment pages, cart functionality, admin pages, and batch upload components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar styling.",
  "frontend/index.html": "HTML entry point for the Artist Connect application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "React application root with TanStack Router configuration defining all routes (artists, jobs, gigs, bookings, store, music, cart, payment, admin, account), wrapped with QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/BatchProductUpload.tsx": "React component for batch product upload with file selection, image preview, editable fields (name, description, price), default value generation, validation, progress tracking, and sequential product creation with toast notifications.",
  "frontend/src/components/BulkImageUpload.tsx": "React component for bulk image upload with metadata (category, subcategory, price, description) for each file, including validation, progress tracking, and blob storage integration.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls via Internet Identity, shopping cart icon with item count, and admin/user dropdown menus.",
  "frontend/src/components/UserProfileSetup.tsx": "Placeholder component for user profile setup dialog that is currently disabled and returns null.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store with persistence for shopping cart state, managing items (products, gigs, music) with add, remove, update quantity, and total calculation functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend API calls including artists, jobs, gigs, bookings, products, music, services, store config, and admin operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes, plus utility classes for gallery grids and artistic shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AccountDashboardPage.tsx": "User account dashboard displaying principal ID and navigation cards to product management and payment settings, with authentication checks and loading states.",
  "frontend/src/pages/AdminSetupPage.tsx": "One-time admin setup page that allows authenticated users to grant themselves admin privileges via the assignAdminPrivileges mutation, then redirects to admin users page.",
  "frontend/src/pages/AdminSiteConfigPage.tsx": "Admin page for configuring site-wide settings like site name, contact email, minimum price, and commission rate with admin role verification.",
  "frontend/src/pages/AdminStoreSettingsPage.tsx": "Admin page for managing store configuration including stock thresholds, shipping, taxes, product categories/tags, pricing rules, approval requirements, and featured products with dynamic list management.",
  "frontend/src/pages/AdminStripeSettingsPage.tsx": "Admin page for configuring Stripe payment integration including publishable/secret keys, webhook settings, currency, and test mode with validation and secure key display toggles.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for managing user roles, displaying a table of all artists with their principals and roles, allowing admins to promote users to admin or demote them to regular users with confirmation dialogs.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays a detailed artist profile page with portfolio gallery, bio, available services, and booking options, fetching artist data by ID from route parameters.",
  "frontend/src/pages/ArtistsListPage.tsx": "Lists all artists in a grid layout with portfolio preview images, bios, skills tags, and links to individual artist profiles.",
  "frontend/src/pages/BookingsPage.tsx": "Displays user's scheduled bookings with service details including date, time, duration, and confirmation status in a card-based layout.",
  "frontend/src/pages/BookServicePage.tsx": "Service booking page that displays an artist's information and their available services with pricing, duration, and booking buttons for date/time selection.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items (music, products, gigs) with quantity controls, calculates totals, and initiates Stripe checkout sessions with configuration validation.",
  "frontend/src/pages/GigDetailPage.tsx": "Displays detailed information for a single gig including title, pricing, delivery time, and description. Handles booking via Stripe checkout session creation and redirects to payment URL.",
  "frontend/src/pages/GigsPage.tsx": "Lists all available gigs in a marketplace view with filtering and displays gig cards showing title, pricing, and delivery time. Provides a dialog for authenticated users to create new gigs with title, description, pricing, and delivery days.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards highlighting platform capabilities (artist profiles, gigs, bookings, store), and call-to-action buttons. Uses gradient backgrounds and displays promotional imagery for the artist marketplace platform.",
  "frontend/src/pages/JobOfferingDetailPage.tsx": "Displays full details of a job posting including title, budget, deadline, and description. Shows an 'Apply for This Job' button and handles navigation back to the jobs list.",
  "frontend/src/pages/JobOfferingsPage.tsx": "Lists all job opportunities with cards showing title, budget, and deadline. Provides a dialog for authenticated users to post new job offerings with title, description, budget, and deadline fields.",
  "frontend/src/pages/MusicLibraryPage.tsx": "Displays a library of music items for sale with audio playback controls and add-to-cart functionality. Includes a creation dialog for authenticated users to upload audio files (MP3, WAV, FLAC, AAC, M4A) with metadata, pricing validation, and upload progress tracking.",
  "frontend/src/pages/MyProfilePage.tsx": "Artist profile management page allowing users to create/view their profile with bio, skills, and contact info, and upload portfolio images with progress tracking.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error information, common failure reasons, and navigation options to return to cart or home.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Payment settings page showing authenticated user's principal ID and payment method information with Stripe integration details.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that clears the cart, displays contextual messages based on purchase type (product/music/gig), and provides navigation options.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page displaying individual product information with images, description, price, and add-to-cart functionality.",
  "frontend/src/pages/ProductManagementPage.tsx": "Product management dashboard for authenticated artists to view, edit, delete their products, and perform batch uploads with dialog-based interfaces.",
  "frontend/src/pages/StorePage.tsx": "Store page component that displays products in a grid, allows authenticated users to create products (single or bulk upload with images), and enables customers to add items to cart. Includes dialog forms for product creation with image upload progress tracking.",
  "frontend/src/utils/fileValidation.ts": "Utility functions for validating image file uploads, checking file types (JPEG, PNG, GIF, WebP) and size limits (10MB max), with batch validation support returning valid and invalid file results.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with hash-based and browser routing, providing functions to extract, persist, and clear URL parameters using sessionStorage for cross-navigation state management.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography with Inter and Playfair Display fonts, extended border radius, shadows, and animations for accordion and fade-in effects.",
  "project_state.json": "Project state document describing an artist marketplace platform with features for profiles, job postings, gigs, bookings, product store with music library, and Stripe payment integration, tracking 8 existing features across 7 requirements."
}