{
  "backend/main.mo": "Main backend actor defining data types and storage maps for artists, jobs, gigs, bookings, products, and music, with access control and storage mixins included via migration support.",
  "backend/migration.mo": "Migration module that transforms OldProduct type to NewProduct by adding a subcategory field with empty string default.",
  "feature_evidence.json": "Feature evidence report documenting implemented music library features including MusicLibraryPage component, upload dialog, routing, navigation links, and React Query hooks with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx with routing, useQueries.ts with React Query hooks, Layout.tsx with navigation, cart/payment pages, admin pages, and utility components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Artist Connect application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "React application root with TanStack Router configuration defining all routes (home, artists, jobs, gigs, bookings, store, music, cart, payment, admin) wrapped in ThemeProvider with Toaster.",
  "frontend/src/components/BulkImageUpload.tsx": "Reusable component for bulk image upload with file validation, preview display, per-image metadata input (category, subcategory, price, description), upload progress tracking, and store configuration pricing validation.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with links to Artists, Jobs, Gigs, Store, and Music Library, plus authentication controls, shopping cart icon with item count, and user dropdown menu with admin settings access. Includes footer with social media links and uses Internet Identity for authentication.",
  "frontend/src/components/UserProfileSetup.tsx": "Placeholder component for user profile setup dialog that is currently disabled (showSetup always false) since backend doesn't have user profile methods. Returns null and users can use the platform without profile setup.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous actors. Automatically invalidates and refetches dependent queries when the actor changes due to identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store with localStorage persistence managing shopping cart state for products, gigs, and music items. Provides methods to add/remove items, update quantities, clear cart, and calculate totals and item counts.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle. Provides authentication status tracking and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend API calls including artist profiles, job offerings, gigs, bookings, products, music, services, and admin functions. Each hook handles data fetching, mutations, and automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes using OKLCH color space. Defines CSS custom properties for theming and includes utility classes for gallery grids and artistic shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component.",
  "frontend/src/pages/AdminSiteConfigPage.tsx": "Admin page for managing platform-wide site configuration settings like site name, contact email, minimum price, and commission rate. Includes authentication and admin role checks with loading states.",
  "frontend/src/pages/AdminStoreSettingsPage.tsx": "Admin page for configuring store/product settings including pricing rules, categories, tags, featured products, stock thresholds, shipping, tax rates, and approval requirements for jobs/products/gigs. Loads and updates store configuration via backend queries.",
  "frontend/src/pages/AdminStripeSettingsPage.tsx": "Admin page for managing Stripe payment integration settings including publishable/secret keys, webhook configuration, currency, and test mode toggle. Validates inputs and securely handles sensitive API credentials.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page displaying all users in a table with ability to assign admin or user roles. Includes confirmation dialog for role changes and prevents self-modification.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Public-facing artist profile page displaying bio, portfolio gallery images, and available services. Fetches artist data by ID from route params with loading and not-found states.",
  "frontend/src/pages/ArtistsListPage.tsx": "Displays a grid of artist profiles with portfolio images, bios, and skills, using useGetAllArtists hook to fetch data and showing loading skeletons while data loads.",
  "frontend/src/pages/BookingsPage.tsx": "Displays a list of user's scheduled bookings with service type, date, time, and duration, using useGetAllBookings hook to fetch and render booking cards.",
  "frontend/src/pages/BookServicePage.tsx": "Shows artist information and their available services for booking, fetching data by artistId and displaying service details with price, duration, and a booking button.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls, calculates totals, and initiates Stripe checkout sessions for both music and store products.",
  "frontend/src/pages/GigDetailPage.tsx": "Shows detailed information for a single gig including title, description, pricing, and delivery time, with a checkout button that creates a Stripe session.",
  "frontend/src/pages/GigsPage.tsx": "Marketplace page listing all available gigs with a dialog for authenticated users to create new gigs by entering title, description, pricing, and delivery time.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section showcasing the platform's value proposition and a features section highlighting artist profiles, job opportunities, bookings, and store capabilities with navigation links.",
  "frontend/src/pages/JobOfferingDetailPage.tsx": "Displays detailed information for a single job offering including title, budget, deadline, and description with an apply button; shows loading state and handles job-not-found scenarios.",
  "frontend/src/pages/JobOfferingsPage.tsx": "Lists all job opportunities with filtering/browsing capabilities and provides authenticated users a dialog form to create new job postings with title, description, budget, and deadline fields.",
  "frontend/src/pages/MusicLibraryPage.tsx": "Displays a browsable music library with playback controls and allows authenticated users to upload and sell music tracks with metadata (title, description, price, category) and audio file validation.",
  "frontend/src/pages/MyProfilePage.tsx": "Manages artist profile creation and editing with bio, skills, and contact info fields, plus portfolio image upload functionality with progress tracking for authenticated users.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays payment failure message with explanation of possible causes and provides navigation options to return to cart or home page while preserving cart items.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows payment confirmation message, clears the shopping cart on mount, and provides navigation buttons to return home or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page component that displays individual product information, images, price, and description with add-to-cart functionality and navigation back to store.",
  "frontend/src/pages/StorePage.tsx": "Store page component with product listing, single and bulk product creation dialogs for authenticated users, image upload handling, and add-to-cart functionality.",
  "frontend/src/utils/fileValidation.ts": "File validation utilities for image uploads with type checking (JPEG, PNG, GIF, WebP), 10MB size limit enforcement, and batch validation support.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, artistic theme with earth tones, Playfair Display and Inter fonts, custom shadows, and animation keyframes.",
  "project_state.json": "Project state document defining an artist marketplace platform with job offerings, gigs, bookings, product store, music library, and Stripe payment integration across multiple features."
}