{
  "backend/main.mo": "Main backend actor defining data types and storage for artists, jobs, gigs, bookings, products, and music, with an isAdmin() query method that checks if the caller matches a hardcoded admin principal.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: creating AdminDashboardPage structure, implementing useIsAdmin React Query hook, and adding admin access control to the dashboard page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with routing, useQueries.ts with the new useIsAdmin hook, Layout.tsx with admin dropdown, and various admin and user-facing pages.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, foregrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Artist Connect', and script tag loading the React app from main.tsx.",
  "frontend/src/App.tsx": "React app root with TanStack Router configuration defining all routes (home, artists, jobs, gigs, store, music, admin dashboard, account pages, etc.), wrapped with QueryClientProvider, ThemeProvider, and Toaster.",
  "frontend/src/components/BatchProductUpload.tsx": "Component for batch uploading multiple product images with individual metadata fields (name, description, price), file validation, preview display, and sequential product creation with progress tracking.",
  "frontend/src/components/BulkImageUpload.tsx": "Component for bulk uploading images with metadata (category, subcategory, price, description) and progress tracking. Validates files, uploads them as ExternalBlobs, and manages upload state for multiple items.",
  "frontend/src/components/DonationDialog.tsx": "Dialog component for donating to artists via Stripe checkout. Accepts donation amount input, validates minimum $1, and redirects to Stripe payment page.",
  "frontend/src/components/EditArtistProfileDialog.tsx": "Dialog for editing artist profile including bio, contact info, skills, and portfolio images. Handles image uploads as ExternalBlobs and validates required fields before submission.",
  "frontend/src/components/EditGigDialog.tsx": "Dialog for editing gig details including title, description, pricing (in cents), and delivery time (converted from days to nanosecond timestamp). Validates inputs and updates via mutation hook.",
  "frontend/src/components/EditJobOfferingDialog.tsx": "Dialog for editing job offerings with fields for job title, description, budget (in cents), and deadline (converted to nanosecond timestamp). Validates future deadline and positive budget.",
  "frontend/src/components/EditMusicDialog.tsx": "Dialog for editing music track metadata (title, price, description, category) without changing the audio file. Converts price to cents and validates all required fields.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing product details including title, description, price, subcategory, and images with validation and upload functionality.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls, user dropdown menu with admin/artist dashboard links, and footer with social media links.",
  "frontend/src/components/UserProfileSetup.tsx": "Placeholder component for user profile setup dialog that is currently disabled and returns null.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store hook for managing shopping cart state with persistence, supporting products, gigs, and music items with add/remove/update operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including artists, jobs, gigs, bookings, products, music, services, and admin operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes, typography settings, and utility classes for gallery layouts and shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AccountDashboardPage.tsx": "User account dashboard displaying principal ID, admin role badge, and navigation cards to product management, payment settings, and admin settings (if admin).",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin-only page for configuring site branding including site name, description, colors, and logo upload with preview functionality.",
  "frontend/src/pages/AdminCommissionSettingsPage.tsx": "Admin-only page for setting platform commission rate percentage, which inversely determines artist revenue share for transactions.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard landing page with navigation cards to Stripe settings, user management, revenue analytics, and branding configuration.",
  "frontend/src/pages/AdminRevenueDashboardPage.tsx": "Admin-only revenue analytics page displaying platform revenue metrics, top artists by earnings, and recent transaction history with product sales and donations.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup page that redirects existing admins to dashboard and displays informational message about pre-configured admin access for non-admins.",
  "frontend/src/pages/AdminSiteConfigPage.tsx": "Admin page for managing site-wide configuration settings like site name, contact email, minimum price, and commission rate. Includes authentication and admin permission checks with loading states.",
  "frontend/src/pages/AdminStoreSettingsPage.tsx": "Admin page for configuring store/product settings including pricing rules, categories, tags, featured products, stock thresholds, shipping, tax rates, and approval requirements for jobs/products/gigs. Loads and updates store configuration via backend queries.",
  "frontend/src/pages/AdminStripeSettingsPage.tsx": "Admin page for managing Stripe payment integration settings including publishable/secret keys, webhook configuration, currency, and test mode. Validates Stripe key formats and persists configuration to backend.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page displaying all platform users in a paginated table with search and role filtering capabilities. Shows user principals and roles with authentication and admin permission checks.",
  "frontend/src/pages/ArtistItemManagementPage.tsx": "Artist dashboard page for managing their own products, music tracks, and gigs with delete functionality and revenue display. Uses tabbed interface to organize different item types and shows total earnings.",
  "frontend/src/pages/ArtistOnboardingPage.tsx": "Landing page showcasing benefits of joining as an artist (global exposure, secure payments, 90% revenue share) with a hero banner and call-to-action to create an artist profile or get started.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays a detailed artist profile page showing bio, skills, contact info, and revenue stats, with options to edit (if own profile) or donate (if viewing another artist's profile).",
  "frontend/src/pages/ArtistsListPage.tsx": "Gallery page listing all artists with portfolio images, bios, and skills, allowing users to browse and navigate to individual artist profiles.",
  "frontend/src/pages/BookingsPage.tsx": "User dashboard showing all scheduled bookings with service details, dates, times, and durations in a card-based layout.",
  "frontend/src/pages/BookServicePage.tsx": "Service booking page for a specific artist, displaying artist information and available services with pricing, duration, and booking options.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, total calculation, and Stripe checkout integration with admin alerts for unconfigured payment processing.",
  "frontend/src/pages/GigDetailPage.tsx": "Displays detailed information about a single gig including title, description, pricing, and delivery time, with a 'Book Now' button that initiates Stripe checkout for authenticated users.",
  "frontend/src/pages/GigsPage.tsx": "Lists all available gigs with create, edit, and delete functionality for authenticated users; allows artists to manage their own gigs and displays gig cards with pricing and delivery information.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards showcasing platform capabilities (artist profiles, gigs, bookings, store), and call-to-action buttons to explore artists and browse the store.",
  "frontend/src/pages/JobOfferingDetailPage.tsx": "Displays detailed information about a specific job offering including title, description, budget, and deadline, with an 'Apply for This Job' button.",
  "frontend/src/pages/JobOfferingsPage.tsx": "Lists all job offerings with create, edit, and delete functionality for employers; displays job cards with budget and deadline information, allowing users to manage their own job postings.",
  "frontend/src/pages/MusicLibraryPage.tsx": "Displays music tracks with upload, edit, and delete capabilities; supports audio file uploads with progress tracking, add-to-cart functionality, and direct Stripe checkout for purchasing music.",
  "frontend/src/pages/MyProfilePage.tsx": "Displays an artist's profile page with revenue statistics (total, pending, paid), transaction history (donations and sales), and profile details including email and bio. Requires authentication via Internet Identity.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Handles payment failure scenarios for products, gigs, music, donations, and Stripe Connect OAuth errors. Displays error messages and provides retry/return navigation based on payment context stored in sessionStorage.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Shows payment settings page displaying user's Principal ID and payment method information. Requires authentication and indicates payments are processed through Stripe.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles successful payment confirmations for products, music, gigs, donations, and Stripe Connect OAuth. Clears cart, displays context-specific success messages, and provides navigation to relevant next steps.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information including images, title, price, and description with a \"Buy Now\" button that initiates Stripe checkout. Requires authentication to purchase.",
  "frontend/src/pages/ProductManagementPage.tsx": "Product management page for authenticated users to view, edit, and delete their own products, with support for batch product uploads via CSV/JSON and inline editing dialogs.",
  "frontend/src/pages/StorePage.tsx": "Public store page displaying all products with purchase functionality via Stripe checkout, includes product creation dialog with individual form and bulk upload tabs.",
  "frontend/src/pages/StripeConnectOnboardingPage.tsx": "Onboarding page for artists to connect their Stripe accounts for receiving payments, currently shows placeholder UI with informational content about the 90/10 revenue split.",
  "frontend/src/utils/fileValidation.ts": "Utility functions for validating image file uploads, checking file types (JPEG, PNG, GIF, WebP) and enforcing a 10MB size limit with batch validation support.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both standard query strings and hash-based routing, with sessionStorage persistence for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including artistic shadows, custom fonts (Inter, Playfair Display), and animation keyframes for UI components.",
  "project_state.json": "Project state tracking for an admin dashboard with Stripe Connect payment system where payments flow directly to users' connected accounts. Admin access is restricted to a single hardcoded principal ID, with features for onboarding and checkout pages in various stages of completion."
}