{
  "backend/main.mo": "Main backend actor defining data types and storage maps for artists, jobs, gigs, bookings, products, and music, with access control initialization, admin privilege granting, and mixins for authorization and storage.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of a Stripe settings navigation card in the AccountDashboardPage, linking to payment settings with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including routing, React Query hooks for backend operations, layout components, payment pages, cart functionality, admin pages, and user management features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes, including sidebar, chart, and UI component styling tokens.",
  "frontend/index.html": "HTML entry point for the Artist Connect application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (artists, jobs, gigs, bookings, store, music, cart, payment, admin, account pages), wrapped with QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/BatchProductUpload.tsx": "Component for batch uploading multiple product images with individual metadata fields (name, description, price), file validation, preview display, and sequential product creation with progress tracking.",
  "frontend/src/components/BulkImageUpload.tsx": "Reusable component for bulk image upload with per-image metadata input (category, subcategory, price, description), file validation, upload progress tracking, and store configuration integration for pricing rules.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with links to Artists, Jobs, Gigs, Store, and Music Library, plus authentication controls, shopping cart icon with item count, and admin/user dropdown menus. Includes footer with social media links and uses Internet Identity for authentication.",
  "frontend/src/components/UserProfileSetup.tsx": "Placeholder component for user profile setup dialog that is currently disabled (returns null). Intended for onboarding new users but skipped since backend lacks user profile methods.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store hook managing shopping cart state with persistence, supporting products, gigs, and music items with add/remove/update quantity operations and total calculations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, delegation validation, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including artists, jobs, gigs, bookings, products, music, services, store configuration, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes using OKLCH color space, plus custom utility classes for gallery grids and artistic shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context wrapping the main App component.",
  "frontend/src/pages/AccountDashboardPage.tsx": "Account dashboard page displaying user's principal ID and navigation cards to manage products, payments, and settings. Includes authentication checks and loading states.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup page that allows authenticated users to grant themselves admin privileges via a button that calls the assignAdminPrivileges mutation and redirects to admin users page.",
  "frontend/src/pages/AdminSiteConfigPage.tsx": "Admin-only page for configuring site-wide settings like site name, contact email, minimum price, and commission rate with save functionality. Includes admin permission checks.",
  "frontend/src/pages/AdminStoreSettingsPage.tsx": "Admin page for managing store configuration including stock thresholds, shipping, tax rates, product categories/tags, pricing rules, featured products, and approval requirements for jobs/products/gigs.",
  "frontend/src/pages/AdminStripeSettingsPage.tsx": "Admin page for configuring Stripe payment settings including publishable/secret keys, webhook configuration, currency, and test mode with validation for key formats.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for managing user roles, displaying all artists in a table with the ability to promote users to admin or demote them to regular users. Includes authentication and authorization checks to ensure only admins can access the page.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays a detailed artist profile page with portfolio gallery, bio, available services, and contact information. Fetches artist data by ID from route params and shows services offered by the artist.",
  "frontend/src/pages/ArtistsListPage.tsx": "Lists all artists in a grid layout with portfolio preview images, bio snippets, and skills tags. Each artist card links to their detailed profile page.",
  "frontend/src/pages/BookingsPage.tsx": "Displays a list of user's bookings with service details including date, time, and duration. Shows empty state when no bookings exist.",
  "frontend/src/pages/BookServicePage.tsx": "Service booking page that displays artist information and their available services with pricing and duration. Provides UI for selecting services to book with date/time selection buttons.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items (music, products, gigs) with quantity controls and checkout functionality. Integrates with Stripe for payment processing and shows configuration warnings if Stripe is not set up.",
  "frontend/src/pages/GigDetailPage.tsx": "Displays detailed information for a single gig, including title, pricing, delivery time, and description. Provides a 'Book Now' button that creates a Stripe checkout session for purchasing the gig.",
  "frontend/src/pages/GigsPage.tsx": "Lists all available gigs in a marketplace view and allows authenticated users to create new gigs via a dialog form. Displays gig cards with title, description, pricing, and delivery time information.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section showcasing the platform's value proposition and feature cards highlighting artist profiles, gigs, bookings, and store functionality. Includes navigation buttons to main sections.",
  "frontend/src/pages/JobOfferingDetailPage.tsx": "Displays detailed information for a single job posting, including title, budget, deadline, and description. Provides an 'Apply for This Job' button for interested artists.",
  "frontend/src/pages/JobOfferingsPage.tsx": "Lists all job opportunities and allows authenticated users to post new job offerings via a dialog form. Displays job cards with title, description, budget, and deadline information.",
  "frontend/src/pages/MusicLibraryPage.tsx": "Displays a library of music items for sale with audio playback functionality and allows authenticated users to upload and create new music listings. Includes file validation, upload progress tracking, and shopping cart integration.",
  "frontend/src/pages/MyProfilePage.tsx": "Artist profile management page allowing users to create/view their profile with bio, skills, contact info, and upload portfolio images with progress tracking.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error information, common failure reasons, and navigation options to return to cart or home.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Payment settings page showing authenticated user's principal ID and payment method information with Stripe integration notice.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that displays contextual messages based on purchase type (product/music/gig), clears cart, and provides navigation options.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page displaying individual product information with images, description, price, and add-to-cart functionality.",
  "frontend/src/pages/ProductManagementPage.tsx": "Product management dashboard for authenticated artists to view, edit, delete their products, and perform batch uploads with dialog-based editing interface.",
  "frontend/src/pages/StorePage.tsx": "Store page component that displays products and provides both single and bulk product creation functionality with image upload support, using React hooks for state management and mutations.",
  "frontend/src/utils/fileValidation.ts": "Utility functions for validating image file uploads, checking file types (JPEG, PNG, GIF, WebP) and enforcing a 10MB size limit for both single and batch uploads.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both hash-based and browser routing, including sessionStorage persistence for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography settings, custom animations, and design tokens for a consistent UI.",
  "project_state.json": "Project state tracking file documenting an e-commerce platform with pending feature requests for batch product upload and admin access grant, plus a known issue with Stripe settings visibility."
}