{
  "backend/main.mo": "Main backend actor defining data types and storage for artists, jobs, gigs, bookings, and products, with mixins for authorization and blob storage, plus CRUD operations for each entity type.",
  "feature_evidence.json": "Feature evidence report documenting five main features (artist profiles, job marketplace, gigs marketplace, booking system, product store) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON summary of frontend files including App.tsx with routing, useQueries.ts with React Query hooks, Layout with navigation, and payment/cart pages with Stripe integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Artist Connect application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for artists, jobs, gigs, bookings, store, cart, and profile pages, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, Internet Identity authentication controls, shopping cart indicator, and footer with social media links.",
  "frontend/src/components/UserProfileSetup.tsx": "Placeholder component for user profile setup dialog that is currently disabled since backend user profile methods are not available.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCart.ts": "Defines a Zustand store for shopping cart state management with persistence, supporting adding/removing items, updating quantities, and calculating totals for products and gigs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating backend data including artist profiles, job offerings, services, bookings, products, and Stripe configuration using the actor from useActor hook.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes using warm earth tones, plus utility classes for gallery grids and artistic shadows.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for authentication.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays a detailed artist profile page with portfolio gallery and available services, fetching data by artist ID from route parameters with loading and error states.",
  "frontend/src/pages/ArtistsListPage.tsx": "Renders a grid gallery of all artist profiles with portfolio previews, skills badges, and links to individual artist pages, including loading skeletons and empty states.",
  "frontend/src/pages/BookingsPage.tsx": "Shows a list of all user bookings with details like service type, date, time, and duration, displaying a placeholder when no bookings exist.",
  "frontend/src/pages/BookServicePage.tsx": "Displays an artist's profile and available services for booking, with navigation back to the artist profile and buttons to select date/time for each service.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls, calculates totals, and initiates Stripe checkout sessions for purchase.",
  "frontend/src/pages/GigDetailPage.tsx": "Shows detailed information about a specific gig including title, description, pricing, and delivery time, with a button to book via Stripe checkout.",
  "frontend/src/pages/GigsPage.tsx": "Displays a marketplace of creative gigs with the ability for authenticated users to create new gigs via a dialog form with title, description, pricing, and delivery time fields.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards highlighting the platform's capabilities for artists including profiles, gigs, bookings, and store functionality.",
  "frontend/src/pages/JobOfferingDetailPage.tsx": "Displays detailed information for a single job offering including title, budget, deadline, and description, with options to navigate back or apply. Handles loading and not-found states.",
  "frontend/src/pages/JobOfferingsPage.tsx": "Lists all job offerings with filtering/browsing capabilities and provides a dialog for authenticated users to create new job postings with title, description, budget, and deadline fields.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows authenticated artists to create and manage their profile including bio, skills, contact info, and portfolio images with upload progress tracking. Requires login to access.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with error icon and provides navigation options to return to cart or home page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows payment success confirmation, clears the shopping cart on mount, and provides navigation to home or store pages.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with image, price, and description, allowing users to add the item to cart or navigate back to store. Handles loading and not-found states.",
  "frontend/src/pages/StorePage.tsx": "Lists all products in a grid with add-to-cart functionality and provides authenticated users a dialog to create new products with image upload, title, description, and price.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography with Inter and Playfair Display fonts, custom animations, and artistic shadow effects for the artist platform UI.",
  "project_state.json": "Project state document describing an online artist marketplace platform with features for profiles, job postings, gigs, bookings, product store, and Stripe payment integration, using warm creative aesthetics with earth tones."
}