{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Music Library and Enhanced Bulk Upload with Metadata",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Create MusicLibraryPage component displaying music items in a responsive grid with audio preview, pricing, and cart functionality",
      "acceptanceCriteria": [
        "Page displays music items in a responsive grid",
        "Each music card shows title, artist, price, and description",
        "Audio preview player allows listening before purchase",
        "Add to Cart button adds music item to shopping cart"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MusicLibraryPage.tsx",
          "operation": "create",
          "description": "Create new page component that fetches all music via useGetAllMusic hook and displays items in a grid layout. Include audio preview using HTML5 audio element with ExternalBlob.getDirectURL() for streaming. Show title, artist name (from Principal), price formatted as currency, description, and 'Add to Cart' button that calls cart.addItem with type 'music'. Include loading skeleton states and empty state message. Use Card components from shadcn/ui for layout consistency."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add authenticated music upload dialog in MusicLibraryPage with audio file selection and metadata input fields",
      "acceptanceCriteria": [
        "Dialog is accessible only to authenticated users",
        "File input accepts common audio formats (MP3, WAV, FLAC, AAC)",
        "Form includes required fields for title, price, description, and category",
        "Upload converts audio file to ExternalBlob format before submission",
        "Success toast notification appears after successful upload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MusicLibraryPage.tsx",
          "operation": "modify",
          "description": "Add Dialog component with authenticated-user guard (check identity from useInternetIdentity). Include file input with accept attribute for .mp3,.wav,.flac,.aac,.m4a formats and max 50MB validation. Add form fields: title (text input), price (number input with min/max from pricing rules), description (textarea), category (text input or Select if categories exist). Convert selected audio file to ExternalBlob.fromBytes before calling useCreateMusic mutation. Show upload progress with withUploadProgress callback. Display toast on success/error. Position 'Upload Music' button in page header, visible only when authenticated."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add /music route to App.tsx router configuration for MusicLibraryPage",
      "acceptanceCriteria": [
        "Route /music renders MusicLibraryPage component",
        "Route follows existing routing patterns in App.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import MusicLibraryPage and add new Route with path='/music' that renders <MusicLibraryPage />. Position the route after the /store route definition, following the existing pattern used for other marketplace pages (gigs, jobs, store)."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add 'Music Library' navigation link to Layout.tsx positioned after Store link",
      "acceptanceCriteria": [
        "Navigation link appears in main header",
        "Link is visible to all users (authenticated and guest)",
        "Link is positioned after Store link in navigation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add new navigation Link to='/music' with text 'Music Library' in the main navigation array. Position it immediately after the Store link. Use the same styling and component structure as existing nav links to maintain UI consistency."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Create React Query hooks for music operations following established patterns",
      "acceptanceCriteria": [
        "All hooks follow React Query patterns used for products and gigs",
        "Mutation hooks invalidate music queries on success",
        "Hooks handle loading, error, and success states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add five new hooks: useGetAllMusic (query hook calling actor.getAllMusic with queryKey ['music']), useGetMusicById (query with musicId parameter and queryKey ['music', musicId]), useCreateMusic (mutation calling actor.createMusic with parameters id, title, audioFileBlob, price, description, category, invalidates ['music'] on success), useUpdateMusic (mutation calling actor.updateMusic, invalidates ['music'] and specific ['music', id]), useDeleteMusic (mutation calling actor.deleteMusic, invalidates ['music']). Follow the same error handling and QueryClient patterns used in existing product/gig hooks."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Extend cart functionality to support music items alongside products and gigs",
      "acceptanceCriteria": [
        "Cart state supports music items alongside products and gigs",
        "Music items display correctly in CartPage with audio icon",
        "Total calculation includes music item prices"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCart.ts",
          "operation": "modify",
          "description": "Extend CartItem type to include music variant with fields: type: 'music', musicId: string, title: string, artist: Principal, price: number. Update addItem, removeItem, and updateQuantity functions to handle 'music' type. Ensure total calculation includes music items. Update persist storage to serialize/deserialize Principal correctly for music items."
        },
        {
          "path": "frontend/src/pages/CartPage.tsx",
          "operation": "modify",
          "description": "Add rendering logic for music cart items. Display music icon (Music or DiscIcon from lucide-react) next to music items. Show title, artist name, and price. Include music items when creating ShoppingItem array for Stripe checkout. Format music items with productName combining title and artist, using music price and quantity."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Enhance BulkImageUpload component with metadata input fields for each uploaded image",
      "acceptanceCriteria": [
        "Each image preview shows editable fields for category, subcategory, price, and description",
        "Category dropdown is populated from backend product categories configuration",
        "Price field validates numeric input with minimum/maximum from store pricing rules",
        "Description field supports multi-line text input",
        "All metadata is submitted when creating products from bulk upload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BulkImageUpload.tsx",
          "operation": "modify",
          "description": "Extend FileWithPreview type to include metadata fields: category (string), subcategory (string), price (number), description (string). For each image preview card, add input controls: Select dropdown for category (fetch categories from useGetStoreProductConfig hook's productCategories array), text Input for subcategory, number Input for price with min/max validation from storeConfig.pricingRules, Textarea for description. Update onUploadComplete callback to pass array of objects containing both ExternalBlob and metadata. Add controlled state for metadata per file indexed by file preview URL. Ensure metadata is captured before upload completion."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Update bulk image upload logic in StorePage to pass metadata to createProduct backend capability",
      "acceptanceCriteria": [
        "Product creation includes all metadata fields from bulk upload form",
        "Each uploaded image creates a product with unique category, subcategory, price, and description",
        "Validation errors display per-image if required fields are missing",
        "Success feedback shows which products were created successfully"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StorePage.tsx",
          "operation": "modify",
          "description": "Update handleBulkUpload callback to receive array of objects with blob and metadata (category, subcategory, price, description) from BulkImageUpload. Validate each item has all required fields before calling useCreateProduct mutation. For each valid item, call createProduct with generated unique ID, title (can be 'Product ' + index or from filename), description, price (convert to bigint), productImages array containing the blob, and subcategory. Track success/failure per item and display aggregated results in toast notifications. Show validation errors with specific item references."
        }
      ]
    }
  ]
}