{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add batch upload function in product management with editable items",
  "requirements": [
    {
      "id": "REQ-70",
      "summary": "Add batch upload interface in ProductManagementPage that allows users to select and upload multiple product images simultaneously",
      "acceptanceCriteria": [
        "ProductManagementPage displays a 'Batch Upload' button or section for authenticated users",
        "Users can select multiple image files at once through a file input dialog",
        "Selected files are validated for image format (JPEG, PNG, GIF, WebP) and size limits"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductManagementPage.tsx",
          "operation": "modify",
          "description": "Add a 'Batch Upload' button in the header section that opens a batch upload dialog. Wire the button to trigger a state change that opens the batch upload interface. Ensure the button is visible only to authenticated users who own products or are admins."
        },
        {
          "path": "frontend/src/components/BatchProductUpload.tsx",
          "operation": "create",
          "description": "Create a new component for batch product upload interface. Include a file input that accepts multiple image files (accept='image/jpeg,image/png,image/gif,image/webp' with multiple attribute). Use the existing fileValidation utility from frontend/src/utils/fileValidation.ts to validate selected files for format and size (10MB max per file). Display validation errors as toast notifications for rejected files. Pass only valid files to the preview/editing stage."
        }
      ]
    },
    {
      "id": "REQ-71",
      "summary": "Display each uploaded image in ProductManagementPage as an editable product entry with input fields for name, description, and price before saving",
      "acceptanceCriteria": [
        "Each uploaded image displays as a preview card with editable fields",
        "Each entry includes text input for product name with a preset default value",
        "Each entry includes textarea for product description with a preset default value",
        "Each entry includes number input for price with a preset default value",
        "Users can modify any field before final submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BatchProductUpload.tsx",
          "operation": "modify",
          "description": "Add a preview section that displays each validated image file as a card with image preview (use object URL for local preview). For each card, include editable form fields: text input for product name (labeled 'Product Name'), textarea for product description (labeled 'Description'), and number input for price in cents (labeled 'Price'). Each field should be bound to local component state that tracks all pending product entries. Include a remove button on each card to allow users to discard individual entries before submission."
        }
      ]
    },
    {
      "id": "REQ-72",
      "summary": "Generate preset default values for product name, description, and price for each uploaded image in the batch upload interface",
      "acceptanceCriteria": [
        "Product name is automatically generated (e.g., from filename or generic pattern like 'Product 1', 'Product 2')",
        "Product description is automatically populated with a default placeholder text",
        "Product price is automatically set to a default value (e.g., from store configuration or a sensible default)",
        "All preset values are editable by the user before saving"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BatchProductUpload.tsx",
          "operation": "modify",
          "description": "When files are selected and validated, automatically generate default values for each product entry: product name derived from filename (remove extension, replace hyphens/underscores with spaces, capitalize first letter) or use pattern 'Product N' where N is the index + 1; product description set to 'Add product description here'; price set to a default value of 1000 cents ($10.00). Store these defaults in the component state for each pending product. Ensure all fields remain editable so users can modify before submission."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Implement batch product creation logic in ProductManagementPage that creates all edited product entries by calling the backend createProduct method for each item",
      "acceptanceCriteria": [
        "A 'Create All Products' or 'Save All' button triggers the batch creation process",
        "Each edited product entry is submitted to the backend createProduct method with its image, name, description, and price",
        "Products are created sequentially or in parallel batches",
        "Progress feedback is displayed during the batch creation process"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BatchProductUpload.tsx",
          "operation": "modify",
          "description": "Add a 'Create All Products' button at the bottom of the batch upload dialog that triggers batch creation. Implement batch creation logic that iterates through all pending product entries and calls the backend createProduct method for each (passing generated product ID, title, description, price in bigint, array containing the ExternalBlob from image file, and empty string for subcategory). Convert image files to ExternalBlob using ExternalBlob.fromBytes before submission. Track upload progress for each image using ExternalBlob.withUploadProgress() and display a progress indicator showing 'Creating product X of Y' during the process. Handle the creation process sequentially to avoid overwhelming the backend."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that the createProduct mutation hook exists and properly invalidates the 'products' query cache after successful creation. If needed, ensure the hook supports batch operations by being callable multiple times in sequence."
        }
      ]
    },
    {
      "id": "REQ-74",
      "summary": "Add success and error toast notifications in ProductManagementPage batch upload to inform users of creation status for each product",
      "acceptanceCriteria": [
        "Success toast appears for each product successfully created",
        "Error toast appears for any product that fails to create with error details",
        "Final summary toast displays total success and failure counts after batch completion",
        "Created products appear in the user's product list after successful creation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BatchProductUpload.tsx",
          "operation": "modify",
          "description": "Import and use the toast notification system (from sonner via the existing Toaster setup in App.tsx). During batch creation, display a success toast for each product created successfully (e.g., 'Product created: {productName}'). Display an error toast for any product that fails with the error message (e.g., 'Failed to create {productName}: {error}'). Track success and failure counts throughout the process. After all products are processed, display a final summary toast showing 'Batch upload complete: X products created, Y failed'. Close the batch upload dialog after successful completion and clear the pending product list. Ensure the product list in ProductManagementPage refreshes automatically via query invalidation."
        },
        {
          "path": "frontend/src/pages/ProductManagementPage.tsx",
          "operation": "modify",
          "description": "Wire the BatchProductUpload component into the page by adding it as a dialog that opens when the 'Batch Upload' button is clicked. Pass necessary props including onComplete callback that closes the dialog and triggers a refresh of the product list. Ensure proper state management for opening/closing the batch upload dialog."
        }
      ]
    }
  ]
}